from threading import *
from time import sleep


# Функция для запуска в потоке
def mysum():
    # Используется глобальная переменная
    global num

    # Начальное значение для слагаемых
    k = 1

    # Текст для отображения суммы
    txt = str(num)

    # Пока Event установлен — поток работает
    while myevent.is_set():

        # Добавляем квадрат текущего числа
        num += k**2

        # Формируем строку суммы
        txt += " + " + str(k**2)

        # Отображаем текущий результат
        print("[", k, "] ", txt, " = ", num, sep="")

        # Следующее число
        k += 1

        # Задержка
        sleep(0.3)


print("Сумма целых чисел")

# Создание потока
t = Thread(target=mysum)

# Начальное значение суммы
num = 0
# Создание Event для управления потоком
myevent = Event()
# Установка флага Event
myevent.set()
# Запуск потока
t.start()
# Работа основного потока
sleep(2)
# Сбрасываем Event — рабочий поток остановится
myevent.clear()
# Ждём завершения рабочего потока
if t.is_alive():
    t.join()
# Вывод результата
print("Результат:", num)
